java_encode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-31 Wed 22:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>JAVA WEB 中的编码分析</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="陈胜 csophys" />
<link rel="stylesheet" type="text/css" href="theme/readtheorg/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="theme/readtheorg/spacemacs.readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">JAVA WEB 中的编码分析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. 常见编码格式的区别</a>
<ul>
<li><a href="#orgheadline1">1.1. 为什么要编码</a></li>
<li><a href="#orgheadline2">1.2. 常见编码格式</a></li>
</ul>
</li>
<li><a href="#orgheadline11">2. 需要编码的场景</a>
<ul>
<li><a href="#orgheadline4">2.1. 磁盘IO</a></li>
<li><a href="#orgheadline5">2.2. 内存中</a></li>
<li><a href="#orgheadline6">2.3. 网络IO</a></li>
<li><a href="#orgheadline10">2.4. java 中编解码的原理</a>
<ul>
<li><a href="#orgheadline7">2.4.1. 编码类图</a></li>
<li><a href="#orgheadline8">2.4.2. 编码时序图</a></li>
<li><a href="#orgheadline9">2.4.3. 各种编码格式编码后的字节数组示例</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">3. JAVA WEB 中涉及的编码问题</a>
<ul>
<li><a href="#orgheadline12">3.1. HTTP请求中涉及到编码的地方</a></li>
<li><a href="#orgheadline13">3.2. URL中的编码</a></li>
<li><a href="#orgheadline14">3.3. HTTP header 中的编码</a></li>
<li><a href="#orgheadline15">3.4. POST 的编码</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> 常见编码格式的区别</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 为什么要编码</h3>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 常见编码格式</h3>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">2</span> 需要编码的场景</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> 磁盘IO</h3>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> 内存中</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>字符和字节之间的转换demo</li>
<li>内存字符占用字节数验证</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.3</span> 网络IO</h3>
<div class="outline-text-3" id="text-2-3">
<p>
但是还是强烈的不建议使用操作系统的默认编码，因为这样，你的应用程序的编码格式就和运行环境绑定起来了，在跨环境下很可能出现乱码问题。
genesys sdk 的demo 示例，怎么来解决的？
</p>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.4</span> java 中编解码的原理</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">2.4.1</span> 编码类图</h4>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">2.4.2</span> 编码时序图</h4>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">2.4.3</span> 各种编码格式编码后的字节数组示例</h4>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">3</span> JAVA WEB 中涉及的编码问题</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.1</span> HTTP请求中涉及到编码的地方</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.2</span> URL中的编码</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>ServletPath和PathInfo中的中文</li>
<li>QueryString中的中文</li>
</ul>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">service</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">apache</span>.<span style="color: #a45bad;">coyote</span>.<span style="color: #ce537a; font-weight: bold;">Request</span> <span style="color: #7590db;">req</span>,
                    <span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">apache</span>.<span style="color: #a45bad;">coyote</span>.<span style="color: #ce537a; font-weight: bold;">Response</span> <span style="color: #7590db;">res</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #4f97d7;">{</span>

    <span style="color: #ce537a; font-weight: bold;">Request</span> <span style="color: #7590db;">request</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Request</span><span style="color: #bc6ec5;">)</span> req.getNote<span style="color: #bc6ec5;">(</span>ADAPTER_NOTES<span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">Response</span> <span style="color: #7590db;">response</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Response</span><span style="color: #bc6ec5;">)</span> res.getNote<span style="color: #bc6ec5;">(</span>ADAPTER_NOTES<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>request == <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>

        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Create objects</span>
        request = connector.createRequest<span style="color: #2d9574;">()</span>;
        request.setCoyoteRequest<span style="color: #2d9574;">(</span>req<span style="color: #2d9574;">)</span>;
        response = connector.createResponse<span style="color: #2d9574;">()</span>;
        response.setCoyoteResponse<span style="color: #2d9574;">(</span>res<span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Link objects</span>
        request.setResponse<span style="color: #2d9574;">(</span>response<span style="color: #2d9574;">)</span>;
        response.setRequest<span style="color: #2d9574;">(</span>request<span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Set as notes</span>
        req.setNote<span style="color: #2d9574;">(</span>ADAPTER_NOTES, request<span style="color: #2d9574;">)</span>;
        res.setNote<span style="color: #2d9574;">(</span>ADAPTER_NOTES, response<span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Set query string encoding</span>
        req.getParameters<span style="color: #2d9574;">()</span>.setQueryStringEncoding
            <span style="color: #2d9574;">(</span>connector.getURIEncoding<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;

    <span style="color: #bc6ec5;">}</span>
</pre>
</div>
<pre class="example">
所以，结论是，queryStringEncoding编码的优先级是，第一是随contentType(设置了useBodyEncodingForURI)，第二随URIEncoding（没有设置useBodyEncodingForURI），第三则是默认编码（即没有设置contentType，设置了useBodyEncodingForURI=true）
</pre>


<div class="org-src-container">

<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">parseParameters</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>

        parametersParsed = <span style="color: #a45bad;">true</span>;

        <span style="color: #ce537a; font-weight: bold;">Parameters</span> <span style="color: #7590db;">parameters</span> = coyoteRequest.getParameters<span style="color: #bc6ec5;">()</span>;
        <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">success</span> = <span style="color: #a45bad;">false</span>;
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Set this every time in case limit has been changed via JMX</span>
            parameters.setLimit<span style="color: #2d9574;">(</span>getConnector<span style="color: #67b11d;">()</span>.getMaxParameterCount<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;

            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">getCharacterEncoding() may have been overridden to search for</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">hidden form field containing request encoding</span>
            <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">enc</span> = getCharacterEncoding<span style="color: #2d9574;">()</span>;

            <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">useBodyEncodingForURI</span> = connector.getUseBodyEncodingForURI<span style="color: #2d9574;">()</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>enc != <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
                parameters.setEncoding<span style="color: #67b11d;">(</span>enc<span style="color: #67b11d;">)</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>useBodyEncodingForURI<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                    parameters.setQueryStringEncoding<span style="color: #b1951d;">(</span>enc<span style="color: #b1951d;">)</span>;
                <span style="color: #67b11d;">}</span>
            <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
                parameters.setEncoding
                    <span style="color: #67b11d;">(</span><span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">apache</span>.<span style="color: #a45bad;">coyote</span>.<span style="color: #a45bad;">Constants</span>.DEFAULT_CHARACTER_ENCODING<span style="color: #67b11d;">)</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>useBodyEncodingForURI<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                    parameters.setQueryStringEncoding
                        <span style="color: #b1951d;">(</span><span style="color: #a45bad;">org</span>.<span style="color: #a45bad;">apache</span>.<span style="color: #a45bad;">coyote</span>.<span style="color: #a45bad;">Constants</span>.DEFAULT_CHARACTER_ENCODING<span style="color: #b1951d;">)</span>;
                <span style="color: #67b11d;">}</span>
            <span style="color: #2d9574;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #bc6ec5; font-weight: bold;">Connector</span> <span style="color: #7590db;">executor</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">tomcatThreadPool</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">protocol</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">org.apache.coyote.http11.Http11NioProtocol</span><span style="color: #2d9574;">"</span>
           <span style="color: #7590db;">port</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">8080</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">URIEncoding</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">UTF-8</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">useBodyEncodingForURI</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">true</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">compression</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">off</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">enableLookups</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">false</span><span style="color: #2d9574;">"</span> 
           <span style="color: #7590db;">maxKeepAliveRequests</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">20</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">bufferSize</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">8192</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">connectionTimeout</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">5000</span><span style="color: #2d9574;">"</span>
           <span style="color: #7590db;">redirectPort</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">8443</span><span style="color: #2d9574;">"</span> <span style="color: #7590db;">server</span>=<span style="color: #2d9574;">"</span><span style="color: #2d9574;">DPServer</span><span style="color: #2d9574;">"</span>/&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.3</span> HTTP header 中的编码</h3>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.4</span> POST 的编码</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #2aa1ae;">/**</span>
<span style="color: #2aa1ae;"> * Get the character encoding used for this request.</span>
<span style="color: #2aa1ae;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #bc6ec5; font-weight: bold;">getCharacterEncoding</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>charEncoding != <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> charEncoding;
    <span style="color: #bc6ec5;">}</span>

    charEncoding = getCharsetFromContentType<span style="color: #bc6ec5;">(</span>getContentType<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> charEncoding;

<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 陈胜 csophys</p>
<p class="date">Created: 2016-08-31 Wed 22:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
